/**
  ******************************************************************************
  * @file:      app_flash.h
  * @author:    shfangyan
  * @version:   
  * @date:      2018-6-5 
  * @brief:           用于详细说明此程序文件完成的主要功能，与其他模块
  *                    或函数的接口，输出值、取值范围、含义及参数间的控
  *                    制、顺序、独立或依赖等关系
  ******************************************************************************
  * @attention:      修改历史记录列表，每条修改记录应包括修改日期、修改
  *                   者及修改内容简述
  *    1. 时间: 2018-6-5
  *       修订者: shfangyan
  *       修订内容: 创建
  *    2.
  ******************************************************************************
  */
#ifndef _APP_FLASH_H_
#define _APP_FLASH_H_



/* Includes ------------------------------------------------------------------*/
#include "Typedef.h"
/* Exported constants --------------------------------------------------------*/
/* Exported macro ------------------------------------------------------------*/
/* Exported types ------------------------------------------------------------*/
/* Exported variables --------------------------------------------------------*/
/* Exported functions --------------------------------------------------------*/

void LoadInfo(void);
void app_flash_task(void);
void app_flash_save(void);
void Flash_test(void);


#endif /* ifndef _APP_FLASH_H_.2018-6-5 14:56:22  ut */

